ProgessBase/Reports/ПРГУсловияДополнительногоИзмененияЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ПРГУсловияДополнительногоИзмененияЦены</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РасширеннаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтрицательноеКрасным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначенияНастроекПанелиПользователя</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПанелиПользователя</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЭлементаОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПредставленияЭлементовОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расшифровки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьСУчетомОтсрочкиЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

ProgessBase/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/ПЦ_ОтсрочкаПовышенияЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПЦ_ОтсрочкаПовышенияЦен</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дивизион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГДивизионы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НСИ_КаналПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_КаналыПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НСИ_Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НСИ_Вывеска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Вывески</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресаПоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГ_ПроектыГП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПЦ_ТоварнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_ТоварныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПЦ_Брендообъем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Брендообъемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЦены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтсрочкаПовышенияЦен</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПЦ_ОтсрочкаПовышенияЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Documents/ПЦ_ОтменаОтсрочкиПовышенияЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПЦ_ОтменаОтсрочкиПовышенияЦен</Name>
			<BasedOn>
				<xr:Item>Document.ПЦ_ОтсрочкаПовышенияЦен</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПЦ_ОтсрочкаПовышенияЦен</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОтсрочкаПовышенияЦен</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПЦ_ОтсрочкаПовышенияЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтмены</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/Catalogs/НСИ_Брендообъемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>НСИ_Брендообъемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТоварнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_ТоварныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИностранноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГ_БизнесКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГ_БизнесКатегория</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/Reports/ПРГУсловияДополнительногоИзмененияЦены/Ext/ObjectModule.bsl
Перем СохраненнаяНастройка Экспорт;        // Текущий вариант отчета

Перем ТаблицаВариантовОтчета Экспорт;      // Таблица вариантов доступных текущему пользователю
Перем РежимТестирования Экспорт;

#Если Клиент ИЛИ ВнешнееСоединение Тогда
	
Функция СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина) Экспорт
	
	//ЗначениеПанелипользователя = ТиповыеОтчеты.ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ЭтотОбъект);
	НастрокаПоУмолчанию        = КомпоновщикНастроек.ПолучитьНастройки();
	ТиповыеОтчеты.ПолучитьПримененуюНастройку(ЭтотОбъект);
	
	СтруктураФильтров = СформироватьСтруктуруФильтров(КомпоновщикНастроек);
	
	Если ФильтрыНеУстановлены(СтруктураФильтров)
		И НЕ Вопрос("Не установлены отборы, отчет может формироваться длительное время, продолжить?", РежимДиалогаВопрос.ДаНетОтмена) = КодВозвратаДиалога.Да Тогда
		
		Возврат Неопределено;	
		
	КонецЕсли; 
	
	СтруктураВнешнихДанных = Новый Структура;
	СтруктураВнешнихДанных.Вставить("ИсходныеДанные", Ценообразование.ПолучитьУсловияДопИзмененияЦеныНоменклатурыНоваяМетодика(СтруктураФильтров.Период, 
		СтруктураФильтров.Контрагент, СтруктураФильтров.АдресПоставки,
		СтруктураФильтров.Проект, СтруктураФильтров.ТоварнаяКатегория, СтруктураФильтров.Брендообъем));
	
	ТиповыеОтчеты.СформироватьТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, СтруктураВнешнихДанных);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастрокаПоУмолчанию);
	
КонецФункции

Функция ТаблицуОтсрочкиЦенНоменклатурыНоваяМетодика(Период='00010101',
	Дивизион=Неопределено, Регион=Неопределено, КаналПродаж=Неопределено, Контрагент=Неопределено, УсловиеПоставки=Неопределено, АдресПоставки=Неопределено,
	Проект=Неопределено, ТоварнаяКатегория=Неопределено, Брендообъем=Неопределено, Номенклатура=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АдресаПоставки.Владелец.Дивизион КАК Дивизион,
		|	АдресаПоставки.НСИ_Регион КАК Регион,
		|	АдресаПоставки.Владелец.НСИ_КаналПродаж КАК КаналПродаж,
		|	АдресаПоставки.Владелец КАК Контрагент,
		|	АдресаПоставки.НСИ_УсловияПоставки КАК УсловияПоставки,
		|	АдресаПоставки.Ссылка КАК АдресПоставки,
		|	АдресаПоставки.Владелец.НСИ_Вывеска КАК Вывеска
		|ПОМЕСТИТЬ втКонтрагентыИАП
		|ИЗ
		|	Справочник.АдресаПоставки КАК АдресаПоставки
		|ГДЕ
		|	АдресаПоставки.Владелец ССЫЛКА Справочник.Контрагенты
		|	И НЕ АдресаПоставки.Владелец.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|	И (НЕ &ФильтроватьПоДивизион
		|			ИЛИ АдресаПоставки.Владелец.Дивизион В (&Дивизион))
		|	И (НЕ &ФильтроватьПоРегион
		|			ИЛИ АдресаПоставки.НСИ_Регион В (&Регион))
		|	И (НЕ &ФильтроватьПоКаналПродаж
		|			ИЛИ АдресаПоставки.Владелец.НСИ_КаналПродаж В (&КаналПродаж))
		|	И (НЕ &ФильтроватьПоКонтрагент
		|			ИЛИ АдресаПоставки.Владелец В (&Контрагент))
		|	И (НЕ &ФильтроватьПоУсловиеПоставки
		|			ИЛИ АдресаПоставки.НСИ_УсловияПоставки В (&УсловиеПоставки))
		|	И (НЕ &ФильтроватьПоАдресПоставки
		|			ИЛИ АдресаПоставки.Ссылка В (&АдресПоставки))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпрНоменклатура.Проект КАК Проект,
		|	СпрНоменклатура.НСИ_ТоварнаяКатегория КАК ТоварнаяКатегория,
		|	СпрНоменклатура.НСИ_Брендообъем КАК Брендообъем,
		|	СпрНоменклатура.Ссылка КАК Номенклатура,
		|	СпрНоменклатура.Услуга,
		|	СпрНоменклатура.ЕдиницаХраненияОстатков,
		|	СпрНоменклатура.СтавкаНДС,
		|	СпрНоменклатура.Код,
		|	МАКСИМУМ(Штрихкоды.Штрихкод) КАК Штрихкод
		|ПОМЕСТИТЬ втНоменклатура
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
		|		ПО (Штрихкоды.ТипШтрихкода = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыШтрихкодов.EAN13))
		|			И (Штрихкоды.ЕдиницаИзмерения = СпрНоменклатура.ЕдиницаХраненияОстатков)
		|			И (Штрихкоды.Владелец = СпрНоменклатура.Ссылка)
		|ГДЕ
		|	НЕ СпрНоменклатура.МКЮ = ЗНАЧЕНИЕ(Справочник.ПРГ_МКЮ.ПустаяСсылка)
		|	И СпрНоменклатура.ЭтоГруппа = ЛОЖЬ
		|	И НЕ СпрНоменклатура.ПометкаУдаления
		|	И (НЕ &ФильтроватьПоПроект
		|			ИЛИ СпрНоменклатура.Проект В (&Проект))
		|	И (НЕ &ФильтроватьПоТоварнаяКатегория
		|			ИЛИ СпрНоменклатура.НСИ_ТоварнаяКатегория В (&ТоварнаяКатегория))
		|	И (НЕ &ФильтроватьПоБрендообъем
		|			ИЛИ СпрНоменклатура.НСИ_Брендообъем В (&Брендообъем))
		|	И (НЕ &ФильтроватьПоНоменклатура
		|			ИЛИ СпрНоменклатура.Ссылка В (&Номенклатура))
		|
		|СГРУППИРОВАТЬ ПО
		|	СпрНоменклатура.Проект,
		|	СпрНоменклатура.НСИ_ТоварнаяКатегория,
		|	СпрНоменклатура.НСИ_Брендообъем,
		|	СпрНоменклатура.Ссылка,
		|	СпрНоменклатура.Услуга,
		|	СпрНоменклатура.ЕдиницаХраненияОстатков,
		|	СпрНоменклатура.СтавкаНДС,
		|	СпрНоменклатура.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.Дивизион,
		|	ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.НСИ_Регион КАК Регион,
		|	ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.НСИ_КаналПродаж КАК КаналПродаж,
		|	ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.НСИ_Вывеска КАК Вывеска,
		|	ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.Контрагент,
		|	ЗНАЧЕНИЕ(Перечисление.ПТЛ_УсловияПоставки.ПустаяСсылка) КАК УсловиеПоставки,
		|	ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.Грузополучатель КАК АдресПоставки,
		|	ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.Проект КАК ПроектГП,
		|	ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.ПЦ_ТоварнаяКатегория КАК ТоварнаяКатегория,
		|	ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.ПЦ_Брендообъем КАК Брендообъем,
		|	ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ТипыЦенНоменклатуры.ПустаяСсылка) КАК ТипЦен,
		|	ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.ДатаНачала,
		|	ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.ДатаОкончания,
		|	ПЦ_ОтменаОтсрочкиПовышенияЦенДокументы.ДатаОтмены,
		|	ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.ДатаЦены
		|ПОМЕСТИТЬ втОтсрочкаПовышенияЦен
		|ИЗ
		|	РегистрСведений.ПЦ_ОтсрочкаПовышенияЦен.СрезПоследних КАК ПЦ_ОтсрочкаПовышенияЦенСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПЦ_ОтменаОтсрочкиПовышенияЦен.Документы КАК ПЦ_ОтменаОтсрочкиПовышенияЦенДокументы
		|		ПО ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.ОтсрочкаПовышенияЦен = ПЦ_ОтменаОтсрочкиПовышенияЦенДокументы.ОтсрочкаПовышенияЦен
		|			И (ПЦ_ОтменаОтсрочкиПовышенияЦенДокументы.Ссылка.Проведен)
		|ГДЕ
		|	(ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.ДатаОкончания >= &Период
		|			ИЛИ ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|	И (ПЦ_ОтменаОтсрочкиПовышенияЦенДокументы.ДатаОтмены ЕСТЬ NULL 
		|			ИЛИ ПЦ_ОтменаОтсрочкиПовышенияЦенДокументы.ДатаОтмены > &Период)
		|	И ПЦ_ОтсрочкаПовышенияЦенСрезПоследних.ДатаЦены < &Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОтсрочкаПовышенияЦен.Дивизион,
		|	втОтсрочкаПовышенияЦен.Регион,
		|	втОтсрочкаПовышенияЦен.КаналПродаж,
		|	втОтсрочкаПовышенияЦен.Вывеска,
		|	втОтсрочкаПовышенияЦен.Контрагент,
		|	втОтсрочкаПовышенияЦен.УсловиеПоставки,
		|	втОтсрочкаПовышенияЦен.АдресПоставки,
		|	втОтсрочкаПовышенияЦен.ПроектГП КАК ПроектГП,
		|	втОтсрочкаПовышенияЦен.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|	втОтсрочкаПовышенияЦен.Брендообъем КАК Брендообъем,
		|	втОтсрочкаПовышенияЦен.Номенклатура КАК Номенклатура,
		|	втОтсрочкаПовышенияЦен.ТипЦен,
		|	ВЫБОР
		|		КОГДА втОтсрочкаПовышенияЦен.Регион = ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА втОтсрочкаПовышенияЦен.КаналПродаж = ЗНАЧЕНИЕ(Справочник.НСИ_КаналыПродаж.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА втОтсрочкаПовышенияЦен.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА втОтсрочкаПовышенияЦен.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА втОтсрочкаПовышенияЦен.АдресПоставки = ЗНАЧЕНИЕ(Справочник.АдресаПоставки.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА втОтсрочкаПовышенияЦен.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ПриоритетПоКонтрагенту,
		|	ВЫБОР
		|		КОГДА втОтсрочкаПовышенияЦен.ПроектГП = ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА втОтсрочкаПовышенияЦен.ТоварнаяКатегория = ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА втОтсрочкаПовышенияЦен.Брендообъем = ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ + ВЫБОР
		|		КОГДА втОтсрочкаПовышенияЦен.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ПриоритетПоНоменклатуре,
		|	втОтсрочкаПовышенияЦен.ДатаНачала,
		|	втОтсрочкаПовышенияЦен.ДатаОкончания,
		|	втОтсрочкаПовышенияЦен.ДатаОтмены,
		|	втОтсрочкаПовышенияЦен.ДатаЦены
		|ПОМЕСТИТЬ втИсходныеДанные
		|ИЗ
		|	втОтсрочкаПовышенияЦен КАК втОтсрочкаПовышенияЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИсходныеДанные.Дивизион,
		|	втИсходныеДанные.Регион,
		|	втИсходныеДанные.КаналПродаж,
		|	втИсходныеДанные.Вывеска,
		|	втИсходныеДанные.Контрагент,
		|	втИсходныеДанные.УсловиеПоставки,
		|	втИсходныеДанные.АдресПоставки,
		|	втИсходныеДанные.ПроектГП,
		|	втИсходныеДанные.ТоварнаяКатегория,
		|	втИсходныеДанные.Брендообъем,
		|	втИсходныеДанные.Номенклатура,
		|	втИсходныеДанные.ТипЦен,
		|	втИсходныеДанные.ПриоритетПоКонтрагенту,
		|	втИсходныеДанные.ПриоритетПоНоменклатуре,
		|	втИсходныеДанные.ДатаНачала,
		|	втИсходныеДанные.ДатаОкончания,
		|	втИсходныеДанные.ДатаОтмены,
		|	втИсходныеДанные.ДатаЦены
		|ПОМЕСТИТЬ вт1
		|ИЗ
		|	втИсходныеДанные КАК втИсходныеДанные
		|ГДЕ
		|	НЕ втИсходныеДанные.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Дивизион,
		|	ВложенныйЗапрос.Регион,
		|	ВложенныйЗапрос.КаналПродаж,
		|	ВложенныйЗапрос.Вывеска,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.УсловиеПоставки,
		|	ВложенныйЗапрос.АдресПоставки,
		|	ВложенныйЗапрос.ПроектГП,
		|	ВложенныйЗапрос.ТоварнаяКатегория,
		|	ВложенныйЗапрос.Брендообъем,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.ТипЦен,
		|	ВложенныйЗапрос.ПриоритетПоКонтрагенту,
		|	ВложенныйЗапрос.ПриоритетПоНоменклатуре,
		|	ВложенныйЗапрос.ДатаНачала,
		|	ВложенныйЗапрос.ДатаОкончания,
		|	ВложенныйЗапрос.ДатаОтмены,
		|	ВложенныйЗапрос.ДатаЦены
		|ИЗ
		|	(ВЫБРАТЬ
		|		втИсходныеДанные.Регион КАК Регион,
		|		ВложенныйЗапрос.Дивизион КАК Дивизион,
		|		втИсходныеДанные.КаналПродаж КАК КаналПродаж,
		|		втИсходныеДанные.Контрагент КАК Контрагент,
		|		втИсходныеДанные.УсловиеПоставки КАК УсловиеПоставки,
		|		втИсходныеДанные.АдресПоставки КАК АдресПоставки,
		|		втИсходныеДанные.ПроектГП КАК ПроектГП,
		|		втИсходныеДанные.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|		втИсходныеДанные.Брендообъем КАК Брендообъем,
		|		втИсходныеДанные.Номенклатура КАК Номенклатура,
		|		втИсходныеДанные.ТипЦен КАК ТипЦен,
		|		втИсходныеДанные.ПриоритетПоКонтрагенту КАК ПриоритетПоКонтрагенту,
		|		втИсходныеДанные.ПриоритетПоНоменклатуре КАК ПриоритетПоНоменклатуре,
		|		втИсходныеДанные.ДатаНачала КАК ДатаНачала,
		|		втИсходныеДанные.ДатаОкончания КАК ДатаОкончания,
		|		втИсходныеДанные.ДатаОтмены КАК ДатаОтмены,
		|		втИсходныеДанные.ДатаЦены КАК ДатаЦены,
		|		втИсходныеДанные.Вывеска КАК Вывеска
		|	ИЗ
		|		втИсходныеДанные КАК втИсходныеДанные,
		|		(ВЫБРАТЬ
		|			втКонтрагентыИАП.Дивизион КАК Дивизион
		|		ИЗ
		|			втКонтрагентыИАП КАК втКонтрагентыИАП
		|		ГДЕ
		|			НЕ втКонтрагентыИАП.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			втКонтрагентыИАП.Дивизион) КАК ВложенныйЗапрос
		|	ГДЕ
		|		втИсходныеДанные.Дивизион = ЗНАЧЕНИЕ(Справочник.ПРГДивизионы.ПустаяСсылка)) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт1.Дивизион,
		|	вт1.Регион,
		|	вт1.КаналПродаж,
		|	вт1.Вывеска,
		|	вт1.Контрагент,
		|	вт1.УсловиеПоставки,
		|	вт1.АдресПоставки,
		|	вт1.ПроектГП,
		|	вт1.ТоварнаяКатегория,
		|	вт1.Брендообъем,
		|	вт1.Номенклатура,
		|	вт1.ТипЦен,
		|	вт1.ПриоритетПоКонтрагенту,
		|	вт1.ПриоритетПоНоменклатуре,
		|	вт1.ДатаНачала,
		|	вт1.ДатаОкончания,
		|	вт1.ДатаОтмены,
		|	вт1.ДатаЦены
		|ПОМЕСТИТЬ вт2
		|ИЗ
		|	вт1 КАК вт1
		|ГДЕ
		|	НЕ вт1.Регион = ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Дивизион,
		|	ВложенныйЗапрос.Регион,
		|	ВложенныйЗапрос.КаналПродаж,
		|	ВложенныйЗапрос.Вывеска,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.УсловиеПоставки,
		|	ВложенныйЗапрос.АдресПоставки,
		|	ВложенныйЗапрос.ПроектГП,
		|	ВложенныйЗапрос.ТоварнаяКатегория,
		|	ВложенныйЗапрос.Брендообъем,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.ТипЦен,
		|	ВложенныйЗапрос.ПриоритетПоКонтрагенту,
		|	ВложенныйЗапрос.ПриоритетПоНоменклатуре,
		|	ВложенныйЗапрос.ДатаНачала,
		|	ВложенныйЗапрос.ДатаОкончания,
		|	ВложенныйЗапрос.ДатаОтмены,
		|	ВложенныйЗапрос.ДатаЦены
		|ИЗ
		|	(ВЫБРАТЬ
		|		вт1.Дивизион КАК Дивизион,
		|		ВложенныйЗапрос.Регион КАК Регион,
		|		вт1.КаналПродаж КАК КаналПродаж,
		|		вт1.Контрагент КАК Контрагент,
		|		вт1.УсловиеПоставки КАК УсловиеПоставки,
		|		вт1.АдресПоставки КАК АдресПоставки,
		|		вт1.ПроектГП КАК ПроектГП,
		|		вт1.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|		вт1.Брендообъем КАК Брендообъем,
		|		вт1.Номенклатура КАК Номенклатура,
		|		вт1.ТипЦен КАК ТипЦен,
		|		вт1.ПриоритетПоКонтрагенту КАК ПриоритетПоКонтрагенту,
		|		вт1.ПриоритетПоНоменклатуре КАК ПриоритетПоНоменклатуре,
		|		вт1.ДатаНачала КАК ДатаНачала,
		|		вт1.ДатаОкончания КАК ДатаОкончания,
		|		вт1.ДатаОтмены КАК ДатаОтмены,
		|		вт1.ДатаЦены КАК ДатаЦены,
		|		вт1.Вывеска КАК Вывеска
		|	ИЗ
		|		вт1 КАК вт1
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				втКонтрагентыИАП.Дивизион КАК Дивизион,
		|				втКонтрагентыИАП.Регион КАК Регион
		|			ИЗ
		|				втКонтрагентыИАП КАК втКонтрагентыИАП
		|			ГДЕ
		|				НЕ втКонтрагентыИАП.Регион = ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				втКонтрагентыИАП.Регион,
		|				втКонтрагентыИАП.Дивизион) КАК ВложенныйЗапрос
		|			ПО вт1.Дивизион = ВложенныйЗапрос.Дивизион
		|	ГДЕ
		|		вт1.Регион = ЗНАЧЕНИЕ(Справочник.Регионы.ПустаяСсылка)) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт2.Дивизион,
		|	вт2.Регион,
		|	вт2.КаналПродаж,
		|	вт2.Вывеска,
		|	вт2.Контрагент,
		|	вт2.УсловиеПоставки,
		|	вт2.АдресПоставки,
		|	вт2.ПроектГП,
		|	вт2.ТоварнаяКатегория,
		|	вт2.Брендообъем,
		|	вт2.Номенклатура,
		|	вт2.ТипЦен,
		|	вт2.ПриоритетПоКонтрагенту,
		|	вт2.ПриоритетПоНоменклатуре,
		|	вт2.ДатаНачала,
		|	вт2.ДатаОкончания,
		|	вт2.ДатаОтмены,
		|	вт2.ДатаЦены
		|ПОМЕСТИТЬ вт3
		|ИЗ
		|	вт2 КАК вт2
		|ГДЕ
		|	НЕ вт2.КаналПродаж = ЗНАЧЕНИЕ(Справочник.НСИ_КаналыПродаж.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Дивизион,
		|	ВложенныйЗапрос.Регион,
		|	ВложенныйЗапрос.КаналПродаж,
		|	ВложенныйЗапрос.Вывеска,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.УсловиеПоставки,
		|	ВложенныйЗапрос.АдресПоставки,
		|	ВложенныйЗапрос.ПроектГП,
		|	ВложенныйЗапрос.ТоварнаяКатегория,
		|	ВложенныйЗапрос.Брендообъем,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.ТипЦен,
		|	ВложенныйЗапрос.ПриоритетПоКонтрагенту,
		|	ВложенныйЗапрос.ПриоритетПоНоменклатуре,
		|	ВложенныйЗапрос.ДатаНачала,
		|	ВложенныйЗапрос.ДатаОкончания,
		|	ВложенныйЗапрос.ДатаОтмены,
		|	ВложенныйЗапрос.ДатаЦены
		|ИЗ
		|	(ВЫБРАТЬ
		|		вт2.Регион КАК Регион,
		|		вт2.Дивизион КАК Дивизион,
		|		ВложенныйЗапрос.КаналПродаж КАК КаналПродаж,
		|		вт2.Контрагент КАК Контрагент,
		|		вт2.УсловиеПоставки КАК УсловиеПоставки,
		|		вт2.АдресПоставки КАК АдресПоставки,
		|		вт2.ПроектГП КАК ПроектГП,
		|		вт2.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|		вт2.Брендообъем КАК Брендообъем,
		|		вт2.Номенклатура КАК Номенклатура,
		|		вт2.ТипЦен КАК ТипЦен,
		|		вт2.ПриоритетПоКонтрагенту КАК ПриоритетПоКонтрагенту,
		|		вт2.ПриоритетПоНоменклатуре КАК ПриоритетПоНоменклатуре,
		|		вт2.ДатаНачала КАК ДатаНачала,
		|		вт2.ДатаОкончания КАК ДатаОкончания,
		|		вт2.ДатаОтмены КАК ДатаОтмены,
		|		вт2.ДатаЦены КАК ДатаЦены,
		|		вт2.Вывеска КАК Вывеска
		|	ИЗ
		|		вт2 КАК вт2
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				втКонтрагентыИАП.Регион КАК Регион,
		|				втКонтрагентыИАП.Дивизион КАК Дивизион,
		|				втКонтрагентыИАП.КаналПродаж КАК КаналПродаж
		|			ИЗ
		|				втКонтрагентыИАП КАК втКонтрагентыИАП
		|			ГДЕ
		|				НЕ втКонтрагентыИАП.КаналПродаж = ЗНАЧЕНИЕ(Справочник.НСИ_КаналыПродаж.ПустаяСсылка)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				втКонтрагентыИАП.Регион,
		|				втКонтрагентыИАП.Дивизион,
		|				втКонтрагентыИАП.КаналПродаж) КАК ВложенныйЗапрос
		|			ПО вт2.Регион = ВложенныйЗапрос.Регион
		|				И вт2.Дивизион = ВложенныйЗапрос.Дивизион
		|	ГДЕ
		|		вт2.КаналПродаж = ЗНАЧЕНИЕ(Справочник.НСИ_КаналыПродаж.ПустаяСсылка)) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт3.Дивизион,
		|	вт3.Регион,
		|	вт3.КаналПродаж,
		|	вт3.Вывеска,
		|	вт3.Контрагент,
		|	вт3.УсловиеПоставки,
		|	вт3.АдресПоставки,
		|	вт3.ПроектГП,
		|	вт3.ТоварнаяКатегория,
		|	вт3.Брендообъем,
		|	вт3.Номенклатура,
		|	вт3.ТипЦен,
		|	вт3.ПриоритетПоКонтрагенту,
		|	вт3.ПриоритетПоНоменклатуре,
		|	вт3.ДатаНачала,
		|	вт3.ДатаОкончания,
		|	вт3.ДатаОтмены,
		|	вт3.ДатаЦены
		|ПОМЕСТИТЬ вт3_1
		|ИЗ
		|	вт3 КАК вт3
		|ГДЕ
		|	НЕ вт3.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Дивизион,
		|	ВложенныйЗапрос.Регион,
		|	ВложенныйЗапрос.КаналПродаж,
		|	ВложенныйЗапрос.Вывеска,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.УсловиеПоставки,
		|	ВложенныйЗапрос.АдресПоставки,
		|	ВложенныйЗапрос.ПроектГП,
		|	ВложенныйЗапрос.ТоварнаяКатегория,
		|	ВложенныйЗапрос.Брендообъем,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.ТипЦен,
		|	ВложенныйЗапрос.ПриоритетПоКонтрагенту,
		|	ВложенныйЗапрос.ПриоритетПоНоменклатуре,
		|	ВложенныйЗапрос.ДатаНачала,
		|	ВложенныйЗапрос.ДатаОкончания,
		|	ВложенныйЗапрос.ДатаОтмены,
		|	ВложенныйЗапрос.ДатаЦены
		|ИЗ
		|	(ВЫБРАТЬ
		|		вт3.Регион КАК Регион,
		|		вт3.Дивизион КАК Дивизион,
		|		вт3.КаналПродаж КАК КаналПродаж,
		|		вт3.Контрагент КАК Контрагент,
		|		вт3.УсловиеПоставки КАК УсловиеПоставки,
		|		вт3.АдресПоставки КАК АдресПоставки,
		|		вт3.ПроектГП КАК ПроектГП,
		|		вт3.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|		вт3.Брендообъем КАК Брендообъем,
		|		вт3.Номенклатура КАК Номенклатура,
		|		вт3.ТипЦен КАК ТипЦен,
		|		вт3.ПриоритетПоКонтрагенту КАК ПриоритетПоКонтрагенту,
		|		вт3.ПриоритетПоНоменклатуре КАК ПриоритетПоНоменклатуре,
		|		вт3.ДатаНачала КАК ДатаНачала,
		|		вт3.ДатаОкончания КАК ДатаОкончания,
		|		вт3.ДатаОтмены КАК ДатаОтмены,
		|		вт3.ДатаЦены КАК ДатаЦены,
		|		ВложенныйЗапрос.Вывеска КАК Вывеска
		|	ИЗ
		|		вт3 КАК вт3
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				втКонтрагентыИАП.Регион КАК Регион,
		|				втКонтрагентыИАП.Дивизион КАК Дивизион,
		|				втКонтрагентыИАП.КаналПродаж КАК КаналПродаж,
		|				втКонтрагентыИАП.Вывеска КАК Вывеска
		|			ИЗ
		|				втКонтрагентыИАП КАК втКонтрагентыИАП
		|			ГДЕ
		|				НЕ втКонтрагентыИАП.КаналПродаж = ЗНАЧЕНИЕ(Справочник.НСИ_КаналыПродаж.ПустаяСсылка)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				втКонтрагентыИАП.Регион,
		|				втКонтрагентыИАП.Дивизион,
		|				втКонтрагентыИАП.КаналПродаж,
		|				втКонтрагентыИАП.Вывеска) КАК ВложенныйЗапрос
		|			ПО вт3.Регион = ВложенныйЗапрос.Регион
		|				И вт3.Дивизион = ВложенныйЗапрос.Дивизион
		|				И вт3.КаналПродаж = ВложенныйЗапрос.КаналПродаж
		|	ГДЕ
		|		вт3.Вывеска = ЗНАЧЕНИЕ(Справочник.НСИ_Вывески.ПустаяСсылка)) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт3_1.Дивизион,
		|	вт3_1.Регион,
		|	вт3_1.КаналПродаж,
		|	вт3_1.Вывеска,
		|	вт3_1.Контрагент,
		|	вт3_1.УсловиеПоставки,
		|	вт3_1.АдресПоставки,
		|	вт3_1.ПроектГП,
		|	вт3_1.ТоварнаяКатегория,
		|	вт3_1.Брендообъем,
		|	вт3_1.Номенклатура,
		|	вт3_1.ТипЦен,
		|	вт3_1.ПриоритетПоКонтрагенту,
		|	вт3_1.ПриоритетПоНоменклатуре,
		|	вт3_1.ДатаНачала,
		|	вт3_1.ДатаОкончания,
		|	вт3_1.ДатаОтмены,
		|	вт3_1.ДатаЦены
		|ПОМЕСТИТЬ вт4
		|ИЗ
		|	вт3_1 КАК вт3_1
		|ГДЕ
		|	НЕ вт3_1.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Дивизион,
		|	ВложенныйЗапрос.Регион,
		|	ВложенныйЗапрос.КаналПродаж,
		|	ВложенныйЗапрос.Вывеска,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.УсловиеПоставки,
		|	ВложенныйЗапрос.АдресПоставки,
		|	ВложенныйЗапрос.ПроектГП,
		|	ВложенныйЗапрос.ТоварнаяКатегория,
		|	ВложенныйЗапрос.Брендообъем,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.ТипЦен,
		|	ВложенныйЗапрос.ПриоритетПоКонтрагенту,
		|	ВложенныйЗапрос.ПриоритетПоНоменклатуре,
		|	ВложенныйЗапрос.ДатаНачала,
		|	ВложенныйЗапрос.ДатаОкончания,
		|	ВложенныйЗапрос.ДатаОтмены,
		|	ВложенныйЗапрос.ДатаЦены
		|ИЗ
		|	(ВЫБРАТЬ
		|		вт3_1.Регион КАК Регион,
		|		вт3_1.Дивизион КАК Дивизион,
		|		вт3_1.КаналПродаж КАК КаналПродаж,
		|		ВложенныйЗапрос.Контрагент КАК Контрагент,
		|		вт3_1.УсловиеПоставки КАК УсловиеПоставки,
		|		вт3_1.АдресПоставки КАК АдресПоставки,
		|		вт3_1.ПроектГП КАК ПроектГП,
		|		вт3_1.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|		вт3_1.Брендообъем КАК Брендообъем,
		|		вт3_1.Номенклатура КАК Номенклатура,
		|		вт3_1.ТипЦен КАК ТипЦен,
		|		вт3_1.ПриоритетПоКонтрагенту КАК ПриоритетПоКонтрагенту,
		|		вт3_1.ПриоритетПоНоменклатуре КАК ПриоритетПоНоменклатуре,
		|		вт3_1.ДатаНачала КАК ДатаНачала,
		|		вт3_1.ДатаОкончания КАК ДатаОкончания,
		|		вт3_1.ДатаОтмены КАК ДатаОтмены,
		|		вт3_1.ДатаЦены КАК ДатаЦены,
		|		вт3_1.Вывеска КАК Вывеска
		|	ИЗ
		|		вт3_1 КАК вт3_1
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				втКонтрагентыИАП.Регион КАК Регион,
		|				втКонтрагентыИАП.Дивизион КАК Дивизион,
		|				втКонтрагентыИАП.КаналПродаж КАК КаналПродаж,
		|				втКонтрагентыИАП.Вывеска КАК Вывеска,
		|				втКонтрагентыИАП.Контрагент КАК Контрагент
		|			ИЗ
		|				втКонтрагентыИАП КАК втКонтрагентыИАП
		|			ГДЕ
		|				НЕ втКонтрагентыИАП.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				втКонтрагентыИАП.Дивизион,
		|				втКонтрагентыИАП.Регион,
		|				втКонтрагентыИАП.КаналПродаж,
		|				втКонтрагентыИАП.Контрагент,
		|				втКонтрагентыИАП.Вывеска) КАК ВложенныйЗапрос
		|			ПО вт3_1.Регион = ВложенныйЗапрос.Регион
		|				И вт3_1.Дивизион = ВложенныйЗапрос.Дивизион
		|				И вт3_1.КаналПродаж = ВложенныйЗапрос.КаналПродаж
		|				И вт3_1.Вывеска = ВложенныйЗапрос.Вывеска
		|	ГДЕ
		|		вт3_1.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Дивизион,
		|	ВложенныйЗапрос.Регион,
		|	ВложенныйЗапрос.КаналПродаж,
		|	ВложенныйЗапрос.Вывеска,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.УсловиеПоставки,
		|	ВложенныйЗапрос.АдресПоставки,
		|	ВложенныйЗапрос.ПроектГП,
		|	ВложенныйЗапрос.ТоварнаяКатегория,
		|	ВложенныйЗапрос.Брендообъем,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.ТипЦен,
		|	ВложенныйЗапрос.ПриоритетПоКонтрагенту,
		|	ВложенныйЗапрос.ПриоритетПоНоменклатуре,
		|	ВложенныйЗапрос.ДатаНачала,
		|	ВложенныйЗапрос.ДатаОкончания,
		|	ВложенныйЗапрос.ДатаОтмены,
		|	ВложенныйЗапрос.ДатаЦены
		|ПОМЕСТИТЬ вт5
		|ИЗ
		|	(ВЫБРАТЬ
		|		вт4.Дивизион КАК Дивизион,
		|		вт4.Регион КАК Регион,
		|		вт4.КаналПродаж КАК КаналПродаж,
		|		вт4.Контрагент КАК Контрагент,
		|		вт4.УсловиеПоставки КАК УсловиеПоставки,
		|		вт4.АдресПоставки КАК АдресПоставки,
		|		вт4.ПроектГП КАК ПроектГП,
		|		вт4.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|		вт4.Брендообъем КАК Брендообъем,
		|		вт4.Номенклатура КАК Номенклатура,
		|		вт4.ТипЦен КАК ТипЦен,
		|		вт4.ПриоритетПоКонтрагенту КАК ПриоритетПоКонтрагенту,
		|		вт4.ПриоритетПоНоменклатуре КАК ПриоритетПоНоменклатуре,
		|		вт4.ДатаНачала КАК ДатаНачала,
		|		вт4.ДатаОкончания КАК ДатаОкончания,
		|		вт4.ДатаОтмены КАК ДатаОтмены,
		|		вт4.ДатаЦены КАК ДатаЦены,
		|		вт4.Вывеска КАК Вывеска
		|	ИЗ
		|		вт4 КАК вт4
		|	ГДЕ
		|		НЕ вт4.УсловиеПоставки = ЗНАЧЕНИЕ(Перечисление.ПТЛ_УсловияПоставки.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВложенныйЗапрос.Дивизион,
		|		ВложенныйЗапрос.Регион,
		|		ВложенныйЗапрос.КаналПродаж,
		|		ВложенныйЗапрос.Контрагент,
		|		ВложенныйЗапрос.УсловияПоставки,
		|		ВложенныйЗапрос.АдресПоставки,
		|		ВложенныйЗапрос.ПроектГП,
		|		ВложенныйЗапрос.ТоварнаяКатегория,
		|		ВложенныйЗапрос.Брендообъем,
		|		ВложенныйЗапрос.Номенклатура,
		|		ВложенныйЗапрос.ТипЦен,
		|		ВложенныйЗапрос.ПриоритетПоКонтрагенту,
		|		ВложенныйЗапрос.ПриоритетПоНоменклатуре,
		|		ВложенныйЗапрос.ДатаНачала,
		|		ВложенныйЗапрос.ДатаОкончания,
		|		ВложенныйЗапрос.ДатаОтмены,
		|		ВложенныйЗапрос.ДатаЦены,
		|		ВложенныйЗапрос.Вывеска
		|	ИЗ
		|		(ВЫБРАТЬ
		|			вт4.Дивизион КАК Дивизион,
		|			вт4.Регион КАК Регион,
		|			вт4.КаналПродаж КАК КаналПродаж,
		|			вт4.Контрагент КАК Контрагент,
		|			ВложенныйЗапрос.УсловияПоставки КАК УсловияПоставки,
		|			вт4.АдресПоставки КАК АдресПоставки,
		|			вт4.ПроектГП КАК ПроектГП,
		|			вт4.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|			вт4.Брендообъем КАК Брендообъем,
		|			вт4.Номенклатура КАК Номенклатура,
		|			вт4.ТипЦен КАК ТипЦен,
		|			вт4.ПриоритетПоКонтрагенту КАК ПриоритетПоКонтрагенту,
		|			вт4.ПриоритетПоНоменклатуре КАК ПриоритетПоНоменклатуре,
		|			вт4.ДатаНачала КАК ДатаНачала,
		|			вт4.ДатаОкончания КАК ДатаОкончания,
		|			вт4.ДатаОтмены КАК ДатаОтмены,
		|			вт4.ДатаЦены КАК ДатаЦены,
		|			вт4.Вывеска КАК Вывеска
		|		ИЗ
		|			вт4 КАК вт4
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					втКонтрагентыИАП.Дивизион КАК Дивизион,
		|					втКонтрагентыИАП.Регион КАК Регион,
		|					втКонтрагентыИАП.КаналПродаж КАК КаналПродаж,
		|					втКонтрагентыИАП.Контрагент КАК Контрагент,
		|					втКонтрагентыИАП.УсловияПоставки КАК УсловияПоставки
		|				ИЗ
		|					втКонтрагентыИАП КАК втКонтрагентыИАП
		|				ГДЕ
		|					НЕ втКонтрагентыИАП.УсловияПоставки = ЗНАЧЕНИЕ(Перечисление.ПТЛ_УсловияПоставки.ПустаяСсылка)
		|				
		|				СГРУППИРОВАТЬ ПО
		|					втКонтрагентыИАП.Регион,
		|					втКонтрагентыИАП.Дивизион,
		|					втКонтрагентыИАП.КаналПродаж,
		|					втКонтрагентыИАП.Контрагент,
		|					втКонтрагентыИАП.УсловияПоставки) КАК ВложенныйЗапрос
		|				ПО вт4.Дивизион = ВложенныйЗапрос.Дивизион
		|					И вт4.Регион = ВложенныйЗапрос.Регион
		|					И вт4.КаналПродаж = ВложенныйЗапрос.КаналПродаж
		|					И вт4.Контрагент = ВложенныйЗапрос.Контрагент
		|		ГДЕ
		|			вт4.УсловиеПоставки = ЗНАЧЕНИЕ(Перечисление.ПТЛ_УсловияПоставки.ПустаяСсылка)) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Регион,
		|	ВложенныйЗапрос.ТипЦен,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.ТоварнаяКатегория,
		|	ВложенныйЗапрос.Брендообъем,
		|	ВложенныйЗапрос.АдресПоставки,
		|	ВложенныйЗапрос.ПроектГП,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.КаналПродаж,
		|	ВложенныйЗапрос.Дивизион,
		|	ВложенныйЗапрос.УсловиеПоставки,
		|	ВложенныйЗапрос.ПриоритетПоКонтрагенту,
		|	ВложенныйЗапрос.ПриоритетПоНоменклатуре,
		|	ВложенныйЗапрос.ДатаОтмены,
		|	ВложенныйЗапрос.ДатаНачала,
		|	ВложенныйЗапрос.ДатаОкончания,
		|	ВложенныйЗапрос.ДатаЦены,
		|	ВложенныйЗапрос.Вывеска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКонтрагентыИАП.Дивизион,
		|	втКонтрагентыИАП.Регион,
		|	втКонтрагентыИАП.КаналПродаж,
		|	вт5.Вывеска,
		|	втКонтрагентыИАП.Контрагент,
		|	втКонтрагентыИАП.УсловияПоставки КАК УсловиеПоставки,
		|	вт5.АдресПоставки,
		|	вт5.ПроектГП,
		|	вт5.ТоварнаяКатегория,
		|	вт5.Брендообъем,
		|	вт5.Номенклатура,
		|	вт5.ТипЦен,
		|	вт5.ПриоритетПоКонтрагенту,
		|	вт5.ПриоритетПоНоменклатуре,
		|	вт5.ДатаНачала,
		|	вт5.ДатаОкончания,
		|	вт5.ДатаОтмены,
		|	вт5.ДатаЦены
		|ПОМЕСТИТЬ вт6
		|ИЗ
		|	вт5 КАК вт5
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКонтрагентыИАП КАК втКонтрагентыИАП
		|		ПО вт5.АдресПоставки = втКонтрагентыИАП.АдресПоставки
		|			И (НЕ вт5.АдресПоставки = ЗНАЧЕНИЕ(Справочник.АдресаПоставки.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт5.Дивизион,
		|	вт5.Регион,
		|	вт5.КаналПродаж,
		|	вт5.Вывеска,
		|	вт5.Контрагент,
		|	вт5.УсловиеПоставки,
		|	ВложенныйЗапрос.АдресПоставки,
		|	вт5.ПроектГП,
		|	вт5.ТоварнаяКатегория,
		|	вт5.Брендообъем,
		|	вт5.Номенклатура,
		|	вт5.ТипЦен,
		|	вт5.ПриоритетПоКонтрагенту,
		|	вт5.ПриоритетПоНоменклатуре,
		|	вт5.ДатаНачала,
		|	вт5.ДатаОкончания,
		|	вт5.ДатаОтмены,
		|	вт5.ДатаЦены
		|ИЗ
		|	вт5 КАК вт5
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			втКонтрагентыИАП.Дивизион КАК Дивизион,
		|			втКонтрагентыИАП.Регион КАК Регион,
		|			втКонтрагентыИАП.КаналПродаж КАК КаналПродаж,
		|			втКонтрагентыИАП.Контрагент КАК Контрагент,
		|			втКонтрагентыИАП.УсловияПоставки КАК УсловияПоставки,
		|			втКонтрагентыИАП.АдресПоставки КАК АдресПоставки
		|		ИЗ
		|			втКонтрагентыИАП КАК втКонтрагентыИАП
		|		
		|		СГРУППИРОВАТЬ ПО
		|			втКонтрагентыИАП.Дивизион,
		|			втКонтрагентыИАП.Регион,
		|			втКонтрагентыИАП.КаналПродаж,
		|			втКонтрагентыИАП.Контрагент,
		|			втКонтрагентыИАП.УсловияПоставки,
		|			втКонтрагентыИАП.АдресПоставки) КАК ВложенныйЗапрос
		|		ПО вт5.Дивизион = ВложенныйЗапрос.Дивизион
		|			И вт5.Регион = ВложенныйЗапрос.Регион
		|			И вт5.КаналПродаж = ВложенныйЗапрос.КаналПродаж
		|			И вт5.Контрагент = ВложенныйЗапрос.Контрагент
		|			И вт5.УсловиеПоставки = ВложенныйЗапрос.УсловияПоставки
		|ГДЕ
		|	вт5.АдресПоставки = ЗНАЧЕНИЕ(Справочник.АдресаПоставки.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт6.Дивизион,
		|	вт6.Регион,
		|	вт6.КаналПродаж,
		|	вт6.Вывеска,
		|	вт6.Контрагент,
		|	вт6.УсловиеПоставки,
		|	вт6.АдресПоставки,
		|	вт6.ПроектГП,
		|	вт6.ТоварнаяКатегория,
		|	вт6.Брендообъем,
		|	вт6.Номенклатура,
		|	вт6.ТипЦен,
		|	вт6.ПриоритетПоКонтрагенту,
		|	вт6.ПриоритетПоНоменклатуре,
		|	вт6.ДатаНачала,
		|	вт6.ДатаОкончания,
		|	вт6.ДатаОтмены,
		|	вт6.ДатаЦены
		|ПОМЕСТИТЬ вт7
		|ИЗ
		|	вт6 КАК вт6
		|ГДЕ
		|	НЕ вт6.ПроектГП = ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт6.Дивизион,
		|	вт6.Регион,
		|	вт6.КаналПродаж,
		|	вт6.Вывеска,
		|	вт6.Контрагент,
		|	вт6.УсловиеПоставки,
		|	вт6.АдресПоставки,
		|	ВложенныйЗапрос.Проект,
		|	вт6.ТоварнаяКатегория,
		|	вт6.Брендообъем,
		|	вт6.Номенклатура,
		|	вт6.ТипЦен,
		|	вт6.ПриоритетПоКонтрагенту,
		|	вт6.ПриоритетПоНоменклатуре,
		|	вт6.ДатаНачала,
		|	вт6.ДатаОкончания,
		|	вт6.ДатаОтмены,
		|	вт6.ДатаЦены
		|ИЗ
		|	вт6 КАК вт6,
		|	(ВЫБРАТЬ
		|		втНоменклатура.Проект КАК Проект
		|	ИЗ
		|		втНоменклатура КАК втНоменклатура
		|	ГДЕ
		|		НЕ втНоменклатура.Проект = ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		втНоменклатура.Проект) КАК ВложенныйЗапрос
		|ГДЕ
		|	вт6.ПроектГП = ЗНАЧЕНИЕ(Справочник.ПРГ_ПроектыГП.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт7.Дивизион,
		|	вт7.Регион,
		|	вт7.КаналПродаж,
		|	вт7.Вывеска,
		|	вт7.Контрагент,
		|	вт7.УсловиеПоставки,
		|	вт7.АдресПоставки,
		|	вт7.ПроектГП,
		|	вт7.ТоварнаяКатегория,
		|	вт7.Брендообъем,
		|	вт7.Номенклатура,
		|	вт7.ТипЦен,
		|	вт7.ПриоритетПоКонтрагенту,
		|	вт7.ПриоритетПоНоменклатуре,
		|	вт7.ДатаНачала,
		|	вт7.ДатаОкончания,
		|	вт7.ДатаОтмены,
		|	вт7.ДатаЦены
		|ПОМЕСТИТЬ вт8
		|ИЗ
		|	вт7 КАК вт7
		|ГДЕ
		|	НЕ вт7.ТоварнаяКатегория = ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт7.Дивизион,
		|	вт7.Регион,
		|	вт7.КаналПродаж,
		|	вт7.Вывеска,
		|	вт7.Контрагент,
		|	вт7.УсловиеПоставки,
		|	вт7.АдресПоставки,
		|	вт7.ПроектГП,
		|	ВложенныйЗапрос.ТоварнаяКатегория,
		|	вт7.Брендообъем,
		|	вт7.Номенклатура,
		|	вт7.ТипЦен,
		|	вт7.ПриоритетПоКонтрагенту,
		|	вт7.ПриоритетПоНоменклатуре,
		|	вт7.ДатаНачала,
		|	вт7.ДатаОкончания,
		|	вт7.ДатаОтмены,
		|	вт7.ДатаЦены
		|ИЗ
		|	вт7 КАК вт7
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			втНоменклатура.Проект КАК Проект,
		|			втНоменклатура.ТоварнаяКатегория КАК ТоварнаяКатегория
		|		ИЗ
		|			втНоменклатура КАК втНоменклатура
		|		ГДЕ
		|			НЕ втНоменклатура.ТоварнаяКатегория = ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			втНоменклатура.Проект,
		|			втНоменклатура.ТоварнаяКатегория) КАК ВложенныйЗапрос
		|		ПО вт7.ПроектГП = ВложенныйЗапрос.Проект
		|ГДЕ
		|	вт7.ТоварнаяКатегория = ЗНАЧЕНИЕ(Справочник.НСИ_ТоварныеКатегории.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт8.Дивизион,
		|	вт8.Регион,
		|	вт8.КаналПродаж,
		|	вт8.Вывеска,
		|	вт8.Контрагент,
		|	вт8.УсловиеПоставки,
		|	вт8.АдресПоставки,
		|	вт8.ПроектГП,
		|	вт8.ТоварнаяКатегория,
		|	вт8.Брендообъем,
		|	вт8.Номенклатура,
		|	вт8.ТипЦен,
		|	вт8.ПриоритетПоКонтрагенту,
		|	вт8.ПриоритетПоНоменклатуре,
		|	вт8.ДатаНачала,
		|	вт8.ДатаОкончания,
		|	вт8.ДатаОтмены,
		|	вт8.ДатаЦены
		|ПОМЕСТИТЬ вт9
		|ИЗ
		|	вт8 КАК вт8
		|ГДЕ
		|	НЕ вт8.Брендообъем = ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт8.Дивизион,
		|	вт8.Регион,
		|	вт8.КаналПродаж,
		|	вт8.Вывеска,
		|	вт8.Контрагент,
		|	вт8.УсловиеПоставки,
		|	вт8.АдресПоставки,
		|	вт8.ПроектГП,
		|	вт8.ТоварнаяКатегория,
		|	ВложенныйЗапрос.Брендообъем,
		|	вт8.Номенклатура,
		|	вт8.ТипЦен,
		|	вт8.ПриоритетПоКонтрагенту,
		|	вт8.ПриоритетПоНоменклатуре,
		|	вт8.ДатаНачала,
		|	вт8.ДатаОкончания,
		|	вт8.ДатаОтмены,
		|	вт8.ДатаЦены
		|ИЗ
		|	вт8 КАК вт8
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			втНоменклатура.Проект КАК Проект,
		|			втНоменклатура.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|			втНоменклатура.Брендообъем КАК Брендообъем
		|		ИЗ
		|			втНоменклатура КАК втНоменклатура
		|		ГДЕ
		|			НЕ втНоменклатура.Брендообъем = ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			втНоменклатура.Проект,
		|			втНоменклатура.ТоварнаяКатегория,
		|			втНоменклатура.Брендообъем) КАК ВложенныйЗапрос
		|		ПО вт8.ПроектГП = ВложенныйЗапрос.Проект
		|			И вт8.ТоварнаяКатегория = ВложенныйЗапрос.ТоварнаяКатегория
		|ГДЕ
		|	вт8.Брендообъем = ЗНАЧЕНИЕ(Справочник.НСИ_Брендообъемы.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт9.Дивизион,
		|	вт9.Регион,
		|	вт9.КаналПродаж,
		|	вт9.Вывеска,
		|	вт9.Контрагент,
		|	вт9.УсловиеПоставки,
		|	вт9.АдресПоставки,
		|	вт9.ПроектГП,
		|	вт9.ТоварнаяКатегория,
		|	вт9.Брендообъем,
		|	вт9.Номенклатура,
		|	вт9.ПриоритетПоКонтрагенту,
		|	вт9.ПриоритетПоНоменклатуре,
		|	вт9.ПриоритетПоКонтрагенту + вт9.ПриоритетПоНоменклатуре КАК Приоритет,
		|	вт9.ДатаНачала,
		|	вт9.ДатаОкончания,
		|	вт9.ДатаОтмены,
		|	вт9.ДатаЦены
		|ПОМЕСТИТЬ вт10
		|ИЗ
		|	вт9 КАК вт9
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втНоменклатура КАК втНоменклатура
		|		ПО вт9.Номенклатура = втНоменклатура.Номенклатура
		|ГДЕ
		|	НЕ вт9.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт9.Контрагент,
		|	вт9.Дивизион,
		|	вт9.Регион,
		|	вт9.КаналПродаж,
		|	вт9.УсловиеПоставки,
		|	вт9.АдресПоставки,
		|	вт9.ПроектГП,
		|	вт9.ТоварнаяКатегория,
		|	вт9.Брендообъем,
		|	вт9.Номенклатура,
		|	вт9.ПриоритетПоКонтрагенту,
		|	вт9.ПриоритетПоНоменклатуре,
		|	вт9.ДатаНачала,
		|	вт9.ДатаОкончания,
		|	вт9.ДатаОтмены,
		|	вт9.ДатаЦены,
		|	вт9.Вывеска
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт9.Дивизион,
		|	вт9.Регион,
		|	вт9.КаналПродаж,
		|	вт9.Вывеска,
		|	вт9.Контрагент,
		|	вт9.УсловиеПоставки,
		|	вт9.АдресПоставки,
		|	вт9.ПроектГП,
		|	вт9.ТоварнаяКатегория,
		|	вт9.Брендообъем,
		|	втНоменклатура.Номенклатура,
		|	вт9.ПриоритетПоКонтрагенту,
		|	вт9.ПриоритетПоНоменклатуре,
		|	вт9.ПриоритетПоКонтрагенту + вт9.ПриоритетПоНоменклатуре,
		|	вт9.ДатаНачала,
		|	вт9.ДатаОкончания,
		|	вт9.ДатаОтмены,
		|	вт9.ДатаЦены
		|ИЗ
		|	вт9 КАК вт9
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втНоменклатура КАК втНоменклатура
		|		ПО вт9.ПроектГП = втНоменклатура.Проект
		|			И вт9.ТоварнаяКатегория = втНоменклатура.ТоварнаяКатегория
		|			И вт9.Брендообъем = втНоменклатура.Брендообъем
		|ГДЕ
		|	вт9.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт10.Дивизион,
		|	вт10.Регион,
		|	вт10.КаналПродаж,
		|	вт10.Вывеска,
		|	вт10.Контрагент,
		|	вт10.УсловиеПоставки,
		|	вт10.АдресПоставки,
		|	вт10.ПроектГП,
		|	вт10.ТоварнаяКатегория,
		|	вт10.Брендообъем,
		|	вт10.Номенклатура,
		|	МАКСИМУМ(вт10.Приоритет) КАК Приоритет
		|ПОМЕСТИТЬ вт10_МаксимальныйПриоритет
		|ИЗ
		|	вт10 КАК вт10
		|
		|СГРУППИРОВАТЬ ПО
		|	вт10.Дивизион,
		|	вт10.Регион,
		|	вт10.КаналПродаж,
		|	вт10.Контрагент,
		|	вт10.УсловиеПоставки,
		|	вт10.АдресПоставки,
		|	вт10.ПроектГП,
		|	вт10.ТоварнаяКатегория,
		|	вт10.Брендообъем,
		|	вт10.Номенклатура,
		|	вт10.Вывеска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт10.Дивизион,
		|	вт10.Регион,
		|	вт10.КаналПродаж,
		|	вт10.Вывеска,
		|	вт10.Контрагент,
		|	вт10.УсловиеПоставки,
		|	вт10.АдресПоставки,
		|	вт10.ПроектГП,
		|	вт10.ТоварнаяКатегория,
		|	вт10.Брендообъем,
		|	вт10.Номенклатура,
		|	вт10.Приоритет,
		|	вт10.ДатаНачала,
		|	вт10.ДатаОкончания,
		|	вт10.ДатаОтмены,
		|	вт10.ДатаЦены
		|ИЗ
		|	вт10 КАК вт10
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт10_МаксимальныйПриоритет КАК вт10_МаксимальныйПриоритет
		|		ПО вт10.Дивизион = вт10_МаксимальныйПриоритет.Дивизион
		|			И вт10.Регион = вт10_МаксимальныйПриоритет.Регион
		|			И вт10.КаналПродаж = вт10_МаксимальныйПриоритет.КаналПродаж
		|			И вт10.Контрагент = вт10_МаксимальныйПриоритет.Контрагент
		|			И вт10.УсловиеПоставки = вт10_МаксимальныйПриоритет.УсловиеПоставки
		|			И вт10.АдресПоставки = вт10_МаксимальныйПриоритет.АдресПоставки
		|			И вт10.ПроектГП = вт10_МаксимальныйПриоритет.ПроектГП
		|			И вт10.ТоварнаяКатегория = вт10_МаксимальныйПриоритет.ТоварнаяКатегория
		|			И вт10.Брендообъем = вт10_МаксимальныйПриоритет.Брендообъем
		|			И вт10.Номенклатура = вт10_МаксимальныйПриоритет.Номенклатура
		|			И вт10.Приоритет = вт10_МаксимальныйПриоритет.Приоритет
		|			И вт10.Вывеска = вт10_МаксимальныйПриоритет.Вывеска";

	//Общие	
	Запрос.УстановитьПараметр("Период",?(Период='00010101',НачалоДня(ТекущаяДата()),НачалоДня(Период)));
	
	//Кому
	Запрос.УстановитьПараметр("Дивизион",?(Дивизион=Неопределено,Справочники.ПРГДивизионы.ПустаяСсылка(),Дивизион));
	Запрос.УстановитьПараметр("ФильтроватьПоДивизион",НЕ Дивизион=Неопределено);
	Запрос.УстановитьПараметр("Регион",?(Регион=Неопределено,Справочники.Регионы.ПустаяСсылка(),Регион));
	Запрос.УстановитьПараметр("ФильтроватьПоРегион",НЕ Регион=Неопределено);
	Запрос.УстановитьПараметр("КаналПродаж",?(КаналПродаж=Неопределено,Справочники.НСИ_КаналыПродаж.ПустаяСсылка(),КаналПродаж));
	Запрос.УстановитьПараметр("ФильтроватьПоКаналПродаж",НЕ КаналПродаж=Неопределено);
	Запрос.УстановитьПараметр("Контрагент",?(Контрагент=Неопределено,Справочники.Контрагенты.ПустаяСсылка(),Контрагент));
	Запрос.УстановитьПараметр("ФильтроватьПоКонтрагент",НЕ Контрагент=Неопределено);
	Запрос.УстановитьПараметр("УсловиеПоставки",?(УсловиеПоставки=Неопределено,Перечисления.ПТЛ_УсловияПоставки.ПустаяСсылка(),УсловиеПоставки));
	Запрос.УстановитьПараметр("ФильтроватьПоУсловиеПоставки",НЕ УсловиеПоставки=Неопределено);
	Запрос.УстановитьПараметр("АдресПоставки",?(АдресПоставки=Неопределено,Справочники.АдресаПоставки.ПустаяСсылка(),АдресПоставки));
	Запрос.УстановитьПараметр("ФильтроватьПоАдресПоставки",НЕ АдресПоставки=Неопределено);
	
	//Что
	Запрос.УстановитьПараметр("Проект",?(Проект=Неопределено,Справочники.ПРГ_ПроектыГП.ПустаяСсылка(),Проект));
	Запрос.УстановитьПараметр("ФильтроватьПоПроект",НЕ Проект=Неопределено);
	Запрос.УстановитьПараметр("ТоварнаяКатегория",?(ТоварнаяКатегория=Неопределено,Справочники.НСИ_ТоварныеКатегории.ПустаяСсылка(),ТоварнаяКатегория));
	Запрос.УстановитьПараметр("ФильтроватьПоТоварнаяКатегория",НЕ ТоварнаяКатегория=Неопределено);
	Запрос.УстановитьПараметр("Брендообъем",?(Брендообъем=Неопределено,Справочники.НСИ_Брендообъемы.ПустаяСсылка(),Брендообъем));
	Запрос.УстановитьПараметр("ФильтроватьПоБрендообъем",НЕ Брендообъем=Неопределено);	
	Запрос.УстановитьПараметр("Номенклатура",?(Номенклатура=Неопределено,Справочники.Номенклатура.ПустаяСсылка(),Номенклатура));
    Запрос.УстановитьПараметр("ФильтроватьПоНоменклатура",НЕ Номенклатура=Неопределено);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура УдалитьДублирующиеЭлементыМассива(Массив)
	
	НовыйМассив = Новый Массив; Соответствие = Новый Соответствие;
	
	Для каждого ЭлементМассива Из Массив Цикл
		Соответствие.Вставить(ЭлементМассива);
	КонецЦикла;
	
	Для каждого КлючИЗначение Из Соответствие Цикл
		НовыйМассив.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;	
	
	Массив = НовыйМассив;

КонецПроцедуры  

Функция ФильтрыНеУстановлены(СтруктураФильтров)
	
	Для каждого Элемент Из СтруктураФильтров Цикл
	
		Если НЕ ТипЗнч(Элемент.Значение) = Тип("Дата")
			И НЕ Элемент.Значение = Неопределено Тогда
			
			Возврат Ложь;
		
		КонецЕсли; 	
	
	КонецЦикла; 

	Возврат Истина;
	
КонецФункции // ФильтрыНеУстановлены(СтруктураФильтров)()

Функция СформироватьСтруктуруФильтров(КомпоновщикНастроек)

	тПериод = КонецДня(ТекущаяДата());
	
	ПараметрНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если ПараметрНачалоПериода <> Неопределено Тогда
		
		мПараметрНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
		Если мПараметрНачалоПериода <> Неопределено Тогда
			тПериод = ПараметрНачалоПериода.Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураФильтров = Новый Структура;	
	СтруктураФильтров.Вставить("Период",тПериод);	
	СтруктураФильтров.Вставить("ПериодПолученияКурсовВалют",СтруктураФильтров.Период);
    СтруктураФильтров.Вставить("Дивизион",Неопределено);
	СтруктураФильтров.Вставить("Регион",Неопределено);
	СтруктураФильтров.Вставить("КаналПродаж",Неопределено);
	СтруктураФильтров.Вставить("Контрагент",Неопределено);
	СтруктураФильтров.Вставить("УсловиеПоставки",Неопределено);
	СтруктураФильтров.Вставить("АдресПоставки",Неопределено);
	СтруктураФильтров.Вставить("Проект",Неопределено);
	СтруктураФильтров.Вставить("ТоварнаяКатегория",Неопределено);
	СтруктураФильтров.Вставить("Брендообъем",Неопределено);
	СтруктураФильтров.Вставить("Номенклатура",Неопределено);
	СтруктураФильтров.Вставить("ТипЦен",Неопределено);
	
	ЭлементыОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Для каждого ЭлементОтбора Из ЭлементыОтбора Цикл
	
		//ЭлементОтбора.Использование //ЭлементОтбора.ЛевоеЗначение	//ЭлементОтбора.ПравоеЗначение
		Если ЭлементОтбора.Использование
			И (ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно ИЛИ ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке)
			//{30.12.2016 Островерхий заявка №б/н 
			//И СтруктураФильтров.Свойство(Строка(ЭлементОтбора.ЛевоеЗначение))
			И Найти(Строка(ЭлементОтбора.ЛевоеЗначение),".") = 0 И СтруктураФильтров.Свойство(Строка(ЭлементОтбора.ЛевоеЗначение)) 
			//30.12.2016 Островерхий} 
			Тогда
		
			СтруктураФильтров.Вставить(Строка(ЭлементОтбора.ЛевоеЗначение),?(ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке,СписокЗначенийВМассив(ЭлементОтбора.ПравоеЗначение),ЭлементОтбора.ПравоеЗначение));
		
		КонецЕсли; 
	
	КонецЦикла; 
	
	Возврат СтруктураФильтров;
	
КонецФункции // СформироватьСтруктуруФильтров(КомпоновщикНастроек)

Функция СписокЗначенийВМассив(СписокЗначений)

	Массив = Новый Массив;
	                       
	Для каждого Элемент Из СписокЗначений Цикл
		Массив.Добавить(Элемент.Значение);
	КонецЦикла; 
	
	Возврат Массив;	

КонецФункции // СписокЗначенийВМассив()

Процедура СохранитьНастройку() Экспорт

	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

Процедура ПрименитьНастройку() Экспорт
	
	Схема = ТиповыеОтчеты.ПолучитьСхемуКомпоновкиОбъекта(ЭтотОбъект);

	// Считываение структуры настроек отчета
 	Если Не СохраненнаяНастройка.Пустая() Тогда
		
		СтруктураНастроек = СохраненнаяНастройка.ХранилищеНастроек.Получить();
		Если Не СтруктураНастроек = Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураНастроек.НастройкиКомпоновщика);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураНастроек);
		Иначе
			КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
		КонецЕсли;
		
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	СтруктураНатроек = Новый Структура();
	//СтруктураНатроек.Вставить("ИспользоватьСобытияПриФормированииОтчета", истина);
	//СтруктураНатроек.Вставить("ПриВыводеЗаголовкаОтчета",                 истина);
	//СтруктураНатроек.Вставить("ПослеВыводаПанелиПользователя",            истина);
	//СтруктураНатроек.Вставить("ПослеВыводаПериода",                       истина);
	//СтруктураНатроек.Вставить("ПослеВыводаПараметра",                     истина);
	//СтруктураНатроек.Вставить("ПослеВыводаГруппировки",                   истина);
	//СтруктураНатроек.Вставить("ПослеВыводаОтбора",                        истина);
	//СтруктураНатроек.Вставить("ДействияПанелиИзменениеФлажкаДопНастроек", истина);
	//СтруктураНатроек.Вставить("ПриПолучениеНастроекПользователя",         истина);
	Возврат СтруктураНатроек;
КонецФункции

#КонецЕсли

#Если Клиент Тогда
	
// Настройка отчета при отработки расшифровки
Процедура Настроить(Отбор) Экспорт
	
	// Настройка отбора
	Для каждого ЭлементОтбора Из Отбор Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ПолеОтбора = ЭлементОтбора.ЛевоеЗначение;
		Иначе
			ПолеОтбора = Новый ПолеКомпоновкиДанных(ЭлементОтбора.Поле);
		КонецЕсли;
		
		Если КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(ПолеОтбора) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлементОтбора, ЭлементОтбора);
		Иначе
			НовыйЭлементОтбора.Использование  = Истина;
			НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
			Если ЭлементОтбора.Иерархия Тогда
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
				КонецЕсли;
			Иначе
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				КонецЕсли;
			КонецЕсли;
			
			НовыйЭлементОтбора.ПравоеЗначение = ЭлементОтбора.Значение;
			
		КонецЕсли;
				
	КонецЦикла;
	
	ТиповыеОтчеты.УдалитьДублиОтбора(КомпоновщикНастроек);
	
КонецПроцедуры

#КонецЕсли

Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
	
КонецПроцедуры

Если СохраненнаяНастройка = Неопределено Тогда
	СохраненнаяНастройка =  Справочники.СохраненныеНастройки.ПустаяСсылка();
КонецЕсли;
